       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOCOBOL.
      * COMENTARIO
       PROCEDURE DIVISION.
           DISPLAY "HELLO COBOL".
           STOP RUN.
           