       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLIENTS.
      * DIVISÕES DE UM PROGRAMA COBOL
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "CLIENTS".
           STOP RUN.
           