       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLIENTS.
      * DIVISÕES DE UM PROGRAMA COBOL
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WRK-NAME    PICTURE X(20)       VALUE "SARAH".
       01  WRK-BALANCE PICTURE S9(05)      VALUE 12000.

       PROCEDURE DIVISION.

           MOVE "SARAH"    TO WRK-NAME.
           MOVE 12000       TO WRK-BALANCE.

           DISPLAY WRK-NAME WRK-BALANCE.
           DISPLAY "SALDO: " WRK-BALANCE.
           STOP RUN.
           